#include <stdio.h>
//int main()
//{
//	int ret = 0;
//	char password[20] = { 0 };
//	printf("请输入密码：>");
//	scanf_s("%s", password,char(20));  

//	getchar(); gerchar 用于接收用户输入的字符。
//	printf("请确认（Y、N）：>");
//	ret = getchar();
//	if (ret == 'Y')
//	{
//		printf("确认成功\n");
//	}
//	else
//	{
//		printf("确认失败\n");
//	}
//	return 0;

//------------------------------------------------------------------------------------------------------------
//有 1、2、3、4 四个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？
//int main()
//{
//	int a, b, c;
//	printf("\n");
//	for (a = 1; a < 5; a++) {
//		for (b = 1; b < 5; b++) {
//			for (c = 1; c < 5; c++) {
//				if (a != b && a != c && b != c) {
//					printf("%d%d%d\n", a, b, c);
//				}
//			}
//		}
//	}
//	return 0;
//}
// -------------------------------------------------------------------------------------------------------------
//企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10% ；
// 利润高于10万元，低于20万元时，低于10万元的部分按10% 提成，高于10万元的部分，可提成7.5 % ；
//20万到40万之间时，高于20万元的部分，可提成5 % ；
// 40万到60万之间时高于40万元的部分，可提成3 % ；
// 60万到100万之间时，高于60万元的部分，可提成1.5 % ；
//高于100万元时，超过100万元的部分按1 % 提成。从键盘输入当月利润I，求应发放奖金总数？
//int main()
//{
//	double i;
//	double sum1, sum2, sum4, sum6, sum10, sum;
//	printf("请输入利润: \n");
//	scanf_s("%lf", &i);
//	sum1 = 100000 * 0.1;
//	sum2 = sum1 + 100000 * 0.075;
//	sum4 = sum2 + 200000 * 0.05;
//	sum6 = sum4 + 200000 * 0.03;
//	sum10 = sum6 + 400000 * 0.015;
//	//sum = sum10 + 400000 * 0.01;
//	if (i <= 100000)
//	{
//		sum = i * 0.1;
//	}
//	else if(i<=200000)
//	{
//		sum = sum1 + (i - 100000) * 0.075;
//	}
//	else if (i <= 400000)
//	{
//		sum = sum2 + (i - 200000) * 0.05;
//	}
//	else if (i <= 600000)
//	{
//		sum = sum4 + (i - 400000) * 0.03;
//
//	}
//	else if(i <=1000000)
//	{
//		sum = sum6 + (i - 600000) * 0.015;
//	}
//	else if (i > 1000000)
//	{
//		sum = sum10 + (i - 1000000) * 0.01;
//	}
//	printf("应发的奖金为%.2lf", sum);
//	return 0;
//}

















